{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v3.14.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Functional",
      "config": {
        "name": "functional_1",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 416, 416, 3],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "input_1"
            },
            "name": "input_1",
            "inbound_nodes": []
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d",
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization",
            "inbound_nodes": [[["conv2d", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer",
            "config": {
              "name": "Softplus",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus",
                "op": "Softplus",
                "input": ["batch_normalization/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus",
            "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer1",
            "config": {
              "name": "Tanh",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh",
                "op": "Tanh",
                "input": ["Softplus"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh",
            "inbound_nodes": [[["tf_op_layer_Softplus", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer2",
            "config": {
              "name": "Mul",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul",
                "op": "Mul",
                "input": ["batch_normalization/FusedBatchNormV3", "Tanh"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul",
            "inbound_nodes": [
              [
                ["batch_normalization", 0, 0, {}],
                ["tf_op_layer_Tanh", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "zero_padding2d",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [1, 0],
                [1, 0]
              ],
              "data_format": "channels_last"
            },
            "name": "zero_padding2d",
            "inbound_nodes": [[["tf_op_layer_Mul", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_1",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_1",
            "inbound_nodes": [[["zero_padding2d", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_1",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_1",
            "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer3",
            "config": {
              "name": "Softplus_1",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_1",
                "op": "Softplus",
                "input": ["batch_normalization_1/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_1",
            "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer4",
            "config": {
              "name": "Tanh_1",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_1",
                "op": "Tanh",
                "input": ["Softplus_1"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_1",
            "inbound_nodes": [[["tf_op_layer_Softplus_1", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer5",
            "config": {
              "name": "Mul_1",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_1",
                "op": "Mul",
                "input": ["batch_normalization_1/FusedBatchNormV3", "Tanh_1"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_1",
            "inbound_nodes": [
              [
                ["batch_normalization_1", 0, 0, {}],
                ["tf_op_layer_Tanh_1", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_3",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_3",
            "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_3",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_3",
            "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer6",
            "config": {
              "name": "Softplus_3",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_3",
                "op": "Softplus",
                "input": ["batch_normalization_3/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_3",
            "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer7",
            "config": {
              "name": "Tanh_3",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_3",
                "op": "Tanh",
                "input": ["Softplus_3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_3",
            "inbound_nodes": [[["tf_op_layer_Softplus_3", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer8",
            "config": {
              "name": "Mul_3",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_3",
                "op": "Mul",
                "input": ["batch_normalization_3/FusedBatchNormV3", "Tanh_3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_3",
            "inbound_nodes": [
              [
                ["batch_normalization_3", 0, 0, {}],
                ["tf_op_layer_Tanh_3", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_4",
              "trainable": true,
              "dtype": "float32",
              "filters": 32,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_4",
            "inbound_nodes": [[["tf_op_layer_Mul_3", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_4",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_4",
            "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer9",
            "config": {
              "name": "Softplus_4",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_4",
                "op": "Softplus",
                "input": ["batch_normalization_4/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_4",
            "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer10",
            "config": {
              "name": "Tanh_4",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_4",
                "op": "Tanh",
                "input": ["Softplus_4"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_4",
            "inbound_nodes": [[["tf_op_layer_Softplus_4", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer11",
            "config": {
              "name": "Mul_4",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_4",
                "op": "Mul",
                "input": ["batch_normalization_4/FusedBatchNormV3", "Tanh_4"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_4",
            "inbound_nodes": [
              [
                ["batch_normalization_4", 0, 0, {}],
                ["tf_op_layer_Tanh_4", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_5",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_5",
            "inbound_nodes": [[["tf_op_layer_Mul_4", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_5",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_5",
            "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer12",
            "config": {
              "name": "Softplus_5",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_5",
                "op": "Softplus",
                "input": ["batch_normalization_5/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_5",
            "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer13",
            "config": {
              "name": "Tanh_5",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_5",
                "op": "Tanh",
                "input": ["Softplus_5"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_5",
            "inbound_nodes": [[["tf_op_layer_Softplus_5", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer14",
            "config": {
              "name": "Mul_5",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_5",
                "op": "Mul",
                "input": ["batch_normalization_5/FusedBatchNormV3", "Tanh_5"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_5",
            "inbound_nodes": [
              [
                ["batch_normalization_5", 0, 0, {}],
                ["tf_op_layer_Tanh_5", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer15",
            "config": {
              "name": "AddV2",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "AddV2",
                "op": "AddV2",
                "input": ["Mul_3", "Mul_5"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_AddV2",
            "inbound_nodes": [
              [
                ["tf_op_layer_Mul_3", 0, 0, {}],
                ["tf_op_layer_Mul_5", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_6",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_6",
            "inbound_nodes": [[["tf_op_layer_AddV2", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_2",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_2",
            "inbound_nodes": [[["tf_op_layer_Mul_1", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_6",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_6",
            "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_2",
            "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer16",
            "config": {
              "name": "Softplus_6",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_6",
                "op": "Softplus",
                "input": ["batch_normalization_6/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_6",
            "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer17",
            "config": {
              "name": "Softplus_2",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_2",
                "op": "Softplus",
                "input": ["batch_normalization_2/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_2",
            "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer18",
            "config": {
              "name": "Tanh_6",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_6",
                "op": "Tanh",
                "input": ["Softplus_6"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_6",
            "inbound_nodes": [[["tf_op_layer_Softplus_6", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer19",
            "config": {
              "name": "Tanh_2",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_2",
                "op": "Tanh",
                "input": ["Softplus_2"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_2",
            "inbound_nodes": [[["tf_op_layer_Softplus_2", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer20",
            "config": {
              "name": "Mul_6",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_6",
                "op": "Mul",
                "input": ["batch_normalization_6/FusedBatchNormV3", "Tanh_6"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_6",
            "inbound_nodes": [
              [
                ["batch_normalization_6", 0, 0, {}],
                ["tf_op_layer_Tanh_6", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer21",
            "config": {
              "name": "Mul_2",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_2",
                "op": "Mul",
                "input": ["batch_normalization_2/FusedBatchNormV3", "Tanh_2"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_2",
            "inbound_nodes": [
              [
                ["batch_normalization_2", 0, 0, {}],
                ["tf_op_layer_Tanh_2", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "TensorFlowOpLayer22",
            "config": {
              "name": "concat",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "concat",
                "op": "ConcatV2",
                "input": ["Mul_6", "Mul_2", "concat/axis"],
                "attr": {
                  "Tidx": { "type": "DT_INT32" },
                  "N": { "i": "2" },
                  "T": { "type": "DT_FLOAT" }
                }
              },
              "constants": { "2": -1 }
            },
            "name": "tf_op_layer_concat",
            "inbound_nodes": [
              [
                ["tf_op_layer_Mul_6", 0, 0, {}],
                ["tf_op_layer_Mul_2", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_7",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_7",
            "inbound_nodes": [[["tf_op_layer_concat", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_7",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_7",
            "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer23",
            "config": {
              "name": "Softplus_7",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_7",
                "op": "Softplus",
                "input": ["batch_normalization_7/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_7",
            "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer24",
            "config": {
              "name": "Tanh_7",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_7",
                "op": "Tanh",
                "input": ["Softplus_7"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_7",
            "inbound_nodes": [[["tf_op_layer_Softplus_7", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer25",
            "config": {
              "name": "Mul_7",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_7",
                "op": "Mul",
                "input": ["batch_normalization_7/FusedBatchNormV3", "Tanh_7"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_7",
            "inbound_nodes": [
              [
                ["batch_normalization_7", 0, 0, {}],
                ["tf_op_layer_Tanh_7", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "ZeroPadding2D",
            "config": {
              "name": "zero_padding2d_1",
              "trainable": true,
              "dtype": "float32",
              "padding": [
                [1, 0],
                [1, 0]
              ],
              "data_format": "channels_last"
            },
            "name": "zero_padding2d_1",
            "inbound_nodes": [[["tf_op_layer_Mul_7", 0, 0, {}]]]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_8",
              "trainable": true,
              "dtype": "float32",
              "filters": 128,
              "kernel_size": [3, 3],
              "strides": [2, 2],
              "padding": "valid",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_8",
            "inbound_nodes": [[["zero_padding2d_1", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_8",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_8",
            "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer26",
            "config": {
              "name": "Softplus_8",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_8",
                "op": "Softplus",
                "input": ["batch_normalization_8/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_8",
            "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer27",
            "config": {
              "name": "Tanh_8",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_8",
                "op": "Tanh",
                "input": ["Softplus_8"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_8",
            "inbound_nodes": [[["tf_op_layer_Softplus_8", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer28",
            "config": {
              "name": "Mul_8",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_8",
                "op": "Mul",
                "input": ["batch_normalization_8/FusedBatchNormV3", "Tanh_8"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_8",
            "inbound_nodes": [
              [
                ["batch_normalization_8", 0, 0, {}],
                ["tf_op_layer_Tanh_8", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_10",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_10",
            "inbound_nodes": [[["tf_op_layer_Mul_8", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_10",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_10",
            "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer29",
            "config": {
              "name": "Softplus_10",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_10",
                "op": "Softplus",
                "input": ["batch_normalization_10/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_10",
            "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer30",
            "config": {
              "name": "Tanh_10",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_10",
                "op": "Tanh",
                "input": ["Softplus_10"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_10",
            "inbound_nodes": [[["tf_op_layer_Softplus_10", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer31",
            "config": {
              "name": "Mul_10",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_10",
                "op": "Mul",
                "input": ["batch_normalization_10/FusedBatchNormV3", "Tanh_10"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_10",
            "inbound_nodes": [
              [
                ["batch_normalization_10", 0, 0, {}],
                ["tf_op_layer_Tanh_10", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_11",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [1, 1],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_11",
            "inbound_nodes": [[["tf_op_layer_Mul_10", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_11",
              "trainable": true,
              "dtype": "float32",
              "axis": [3],
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": { "class_name": "Zeros", "config": {} },
              "gamma_initializer": { "class_name": "Ones", "config": {} },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "name": "batch_normalization_11",
            "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer32",
            "config": {
              "name": "Softplus_11",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Softplus_11",
                "op": "Softplus",
                "input": ["batch_normalization_11/FusedBatchNormV3"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Softplus_11",
            "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer33",
            "config": {
              "name": "Tanh_11",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Tanh_11",
                "op": "Tanh",
                "input": ["Softplus_11"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Tanh_11",
            "inbound_nodes": [[["tf_op_layer_Softplus_11", 0, 0, {}]]]
          },
          {
            "class_name": "TensorFlowOpLayer34",
            "config": {
              "name": "Mul_11",
              "trainable": true,
              "dtype": "float32",
              "node_def": {
                "name": "Mul_11",
                "op": "Mul",
                "input": ["batch_normalization_11/FusedBatchNormV3", "Tanh_11"],
                "attr": { "T": { "type": "DT_FLOAT" } }
              },
              "constants": {}
            },
            "name": "tf_op_layer_Mul_11",
            "inbound_nodes": [
              [
                ["batch_normalization_11", 0, 0, {}],
                ["tf_op_layer_Tanh_11", 0, 0, {}]
              ]
            ]
          },
          {
            "class_name": "Conv2D",
            "config": {
              "name": "conv2d_12",
              "trainable": true,
              "dtype": "float32",
              "filters": 64,
              "kernel_size": [3, 3],
              "strides": [1, 1],
              "padding": "same",
              "data_format": "channels_last",
              "dilation_rate": [1, 1],
              "groups": 1,
              "activation": "linear",
              "use_bias": false,
              "kernel_initializer": {
                "class_name": "RandomNormal",
                "config": { "mean": 0.0, "stddev": 0.01, "seed": null }
              },
              "bias_initializer": {
                "class_name": "Constant",
                "config": { "value": 0.0 }
              },
              "kernel_regularizer": {
                "class_name": "L1L2",
                "config": { "l2": 0.0005000000237487257 }
              },
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "name": "conv2d_12",
            "inbound_nodes": [[["tf_op_layer_Mul_11", 0, 0, {}]]]
          },
          {
            "class_name": "BatchNormalization",
